<?php

return [
    '400' => [
        'title' => 'Bad Request',
        'message' => 'طلب سيء',
    ],
    '401' => [
        'title' => 'غير المصرح به',
        'message' => 'غير المصرح به',
    ],
    '402' => [
        'title' => 'الدفع مطلوب',
        'message' => 'الدفع مطلوب',
    ],
    '403' => [
        'title' => 'ممنوع',
        'message' => 'عفوا ، حدث خطأ. <br> تم رفض الوصول إلى هذا المورد على الخادم.',
    ],
    '404' => [
        'title' => 'الصفحة المطلوبة غير موجودة!',
        'message' => 'للأسف لم يتم العثور على الصفحة التي طلبتها. قد يكون الرابط خاطئ أو الصفحة حذفت.',
    ],
    '405' => [
        'title' => 'الطريقة غير مسموح بها',
        'message' => 'شيء مكسور. يرجى إعلامنا بما كنت تفعله عند حدوث هذا الخطأ. سنقوم بإصلاحه في أقرب وقت ممكن. نأسف لأي إزعاج.',
    ],
    '419' => [
        'title' => 'انتهت صلاحية الصفحة',
        'message' => 'انتهت صلاحية الصفحة',
    ],
    '429' => [
        'title' => 'طلبات كثيرة جدا',
        'message' => 'طلبات كثيرة جدا',
    ],
    '500' => [
        'title' => 'خطأ في الخادم',
        'message' => 'واجه الخادم خطأ داخليا ولم يتمكن من <br> إكمال طلبك.',
    ],
    '503' => [
        'title' => 'الخدمة غير متوفرة',
        'message' => 'الخدمة التي طلبتها غير متوفرة في الوقت الحالي. <br> يرجى إعادة المحاولة لاحقا.',
    ],
    'token' => [
        'title' => 'رمز مرور غير صالح',
        'message' => 'رمز مرور غير صالح',
    ],
    'suspended' => [
        'title' => 'حساب معلق!',
        'message' => 'يرجى الاتصال بفريق الدعم لدينا لمزيد من المساعدة.',
    ],

    'return_to_dashboard' => 'عودة الى الرئيسية',
    'return_to_site' => 'العودة الى الموقع ',
];
